In [1]:
import pandas as pd
import numpy as np
from numpy import asarray
import seaborn as sns

In [2]:
df = pd.read_csv('./data/train.csv',low_memory=False)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        100000 non-null  object
 1   Customer_ID               100000 non-null  object
 2   Month                     100000 non-null  object
 3   Name                      90015 non-null   object
 4   Age                       100000 non-null  object
 5   SSN                       100000 non-null  object
 6   Occupation                100000 non-null  object
 7   Annual_Income             100000 non-null  object
 8   Monthly_Inhand_Salary     84998 non-null   float64
 9   Num_Bank_Accounts         100000 non-null  int64
 10  Num_Credit_Card           100000 non-null  int64
 11  Interest_Rate             100000 non-null  int64
 12  Num_of_Loan               100000 non-null  object
 13  Type_of_Loan              88592 non-null   object
 14  Delay_from_due_date       100000 non-null  int64
 15  Num_of_Delayed_Payment    92998 non-null   object
 16  Changed_Credit_Limit      100000 non-null  object
 17  Num_Credit_Inquiries      98035 non-null   float64
 18  Credit_Mix                100000 non-null  object
 19  Outstanding_Debt          100000 non-null  object
 20  Credit_Utilization_Ratio  100000 non-null  float64
 21  Credit_History_Age        90970 non-null   object
 22  Payment_of_Min_Amount     100000 non-null  object
 23  Total_EMI_per_month       100000 non-null  float64
 24  Amount_invested_monthly   95521 non-null   object
 25  Payment_Behaviour         100000 non-null  object
 26  Monthly_Balance           98800 non-null   object
 27  Credit_Score              100000 non-null  object
dtypes: float64(4), int64(4), object(20)
memory usage: 21.4+ MB

In [4]:
df.head()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good

In [5]:
df.drop(['ID','Customer_ID','Month','Name','SSN','Type_of_Loan'],inplace=True, axis=1)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 22 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   Age                       100000 non-null  object
 1   Occupation                100000 non-null  object
 2   Annual_Income             100000 non-null  object
 3   Monthly_Inhand_Salary     84998 non-null   float64
 4   Num_Bank_Accounts         100000 non-null  int64
 5   Num_Credit_Card           100000 non-null  int64
 6   Interest_Rate             100000 non-null  int64
 7   Num_of_Loan               100000 non-null  object
 8   Delay_from_due_date       100000 non-null  int64
 9   Num_of_Delayed_Payment    92998 non-null   object
 10  Changed_Credit_Limit      100000 non-null  object
 11  Num_Credit_Inquiries      98035 non-null   float64
 12  Credit_Mix                100000 non-null  object
 13  Outstanding_Debt          100000 non-null  object
 14  Credit_Utilization_Ratio  100000 non-null  float64
 15  Credit_History_Age        90970 non-null   object
 16  Payment_of_Min_Amount     100000 non-null  object
 17  Total_EMI_per_month       100000 non-null  float64
 18  Amount_invested_monthly   95521 non-null   object
 19  Payment_Behaviour         100000 non-null  object
 20  Monthly_Balance           98800 non-null   object
 21  Credit_Score              100000 non-null  object
dtypes: float64(4), int64(4), object(14)
memory usage: 16.8+ MB

In [7]:
df['Age'] = df.Age.str.replace('_','')

In [8]:
df['Age'] = df.Age.astype(float)

In [9]:
df = df.loc[(df['Age'] > 16) & (df['Age'] < 90)]

In [10]:
df['Age'] = df.Age.astype(object)

In [11]:
df.Age.value_counts()

38.0    2994
28.0    2968
31.0    2955
26.0    2945
32.0    2884
36.0    2868
35.0    2866
25.0    2861
27.0    2859
39.0    2846
34.0    2837
44.0    2824
19.0    2793
22.0    2785
41.0    2785
20.0    2744
37.0    2742
29.0    2735
43.0    2734
30.0    2727
21.0    2716
24.0    2714
23.0    2654
45.0    2642
40.0    2609
42.0    2577
33.0    2543
18.0    2385
46.0    1621
17.0    1502
48.0    1385
49.0    1375
55.0    1366
52.0    1356
53.0    1354
54.0    1311
51.0    1291
50.0    1273
47.0    1227
56.0     362
Name: Age, dtype: int64

In [12]:
df['Occupation'].value_counts()

_______          6576
Lawyer           6133
Architect        5962
Engineer         5920
Accountant       5869
Scientist        5838
Mechanic         5816
Developer        5805
Media_Manager    5766
Journalist       5741
Teacher          5720
Entrepreneur     5713
Doctor           5639
Musician         5527
Manager          5510
Writer           5480
Name: Occupation, dtype: int64

In [13]:
df['Occupation'] = df.Occupation.str.replace('_______','other')

In [14]:
df.drop(['Occupation'],inplace=True, axis=1)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 93015 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       93015 non-null  object
 1   Annual_Income             93015 non-null  object
 2   Monthly_Inhand_Salary     79073 non-null  float64
 3   Num_Bank_Accounts         93015 non-null  int64
 4   Num_Credit_Card           93015 non-null  int64
 5   Interest_Rate             93015 non-null  int64
 6   Num_of_Loan               93015 non-null  object
 7   Delay_from_due_date       93015 non-null  int64
 8   Num_of_Delayed_Payment    86460 non-null  object
 9   Changed_Credit_Limit      93015 non-null  object
 10  Num_Credit_Inquiries      91191 non-null  float64
 11  Credit_Mix                93015 non-null  object
 12  Outstanding_Debt          93015 non-null  object
 13  Credit_Utilization_Ratio  93015 non-null  float64
 14  Credit_History_Age        84607 non-null  object
 15  Payment_of_Min_Amount     93015 non-null  object
 16  Total_EMI_per_month       93015 non-null  float64
 17  Amount_invested_monthly   88857 non-null  object
 18  Payment_Behaviour         93015 non-null  object
 19  Monthly_Balance           91909 non-null  object
 20  Credit_Score              93015 non-null  object
dtypes: float64(4), int64(4), object(13)
memory usage: 15.6+ MB

In [16]:
df['Annual_Income'] = df.Annual_Income.str.replace('_','')

In [17]:
df['Annual_Income'].value_counts()

20867.67      16
109945.32     16
40341.16      16
32543.38      16
36585.12      16
              ..
21958247.0     1
1605533.0      1
20099781.0     1
15333374.0     1
7339095.0      1
Name: Annual_Income, Length: 12942, dtype: int64

In [18]:
df['Annual_Income'] = df.Annual_Income.astype(float)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 93015 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       93015 non-null  object
 1   Annual_Income             93015 non-null  float64
 2   Monthly_Inhand_Salary     79073 non-null  float64
 3   Num_Bank_Accounts         93015 non-null  int64
 4   Num_Credit_Card           93015 non-null  int64
 5   Interest_Rate             93015 non-null  int64
 6   Num_of_Loan               93015 non-null  object
 7   Delay_from_due_date       93015 non-null  int64
 8   Num_of_Delayed_Payment    86460 non-null  object
 9   Changed_Credit_Limit      93015 non-null  object
 10  Num_Credit_Inquiries      91191 non-null  float64
 11  Credit_Mix                93015 non-null  object
 12  Outstanding_Debt          93015 non-null  object
 13  Credit_Utilization_Ratio  93015 non-null  float64
 14  Credit_History_Age        84607 non-null  object
 15  Payment_of_Min_Amount     93015 non-null  object
 16  Total_EMI_per_month       93015 non-null  float64
 17  Amount_invested_monthly   88857 non-null  object
 18  Payment_Behaviour         93015 non-null  object
 19  Monthly_Balance           91909 non-null  object
 20  Credit_Score              93015 non-null  object
dtypes: float64(5), int64(4), object(12)
memory usage: 15.6+ MB

In [20]:
df['Num_of_Loan'] = df.Num_of_Loan.str.replace('_','')

In [21]:
df['Num_of_Loan'] = df.Num_of_Loan.astype(float)

In [22]:
df = df.loc[(df['Num_of_Loan'] > 1) & (df['Num_of_Loan'] < 10)]

In [23]:
df['Num_of_Loan'] = df.Num_of_Loan.astype(object)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 68206 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       68206 non-null  object
 1   Annual_Income             68206 non-null  float64
 2   Monthly_Inhand_Salary     58016 non-null  float64
 3   Num_Bank_Accounts         68206 non-null  int64
 4   Num_Credit_Card           68206 non-null  int64
 5   Interest_Rate             68206 non-null  int64
 6   Num_of_Loan               68206 non-null  object
 7   Delay_from_due_date       68206 non-null  int64
 8   Num_of_Delayed_Payment    63418 non-null  object
 9   Changed_Credit_Limit      68206 non-null  object
 10  Num_Credit_Inquiries      66887 non-null  float64
 11  Credit_Mix                68206 non-null  object
 12  Outstanding_Debt          68206 non-null  object
 13  Credit_Utilization_Ratio  68206 non-null  float64
 14  Credit_History_Age        62020 non-null  object
 15  Payment_of_Min_Amount     68206 non-null  object
 16  Total_EMI_per_month       68206 non-null  float64
 17  Amount_invested_monthly   65134 non-null  object
 18  Payment_Behaviour         68206 non-null  object
 19  Monthly_Balance           67209 non-null  object
 20  Credit_Score              68206 non-null  object
dtypes: float64(5), int64(4), object(12)
memory usage: 11.4+ MB

In [25]:
df['Num_of_Delayed_Payment'].value_counts()

19      4039
17      3803
18      3751
16      3704
20      3688
        ...
1530       1
4134       1
848_       1
2616       1
2047       1
Name: Num_of_Delayed_Payment, Length: 549, dtype: int64

In [26]:
df['Num_of_Delayed_Payment'] = df.Num_of_Delayed_Payment.str.replace('_','')

In [27]:
df['Num_of_Delayed_Payment'] = df.Num_of_Delayed_Payment.astype(float)

In [28]:
df = df.loc[(df['Num_of_Delayed_Payment'] > 1) & (df['Num_of_Delayed_Payment'] < 40)]

In [29]:
df['Num_of_Delayed_Payment'] = df.Num_of_Delayed_Payment.astype(object)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60732 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       60732 non-null  object
 1   Annual_Income             60732 non-null  float64
 2   Monthly_Inhand_Salary     51667 non-null  float64
 3   Num_Bank_Accounts         60732 non-null  int64
 4   Num_Credit_Card           60732 non-null  int64
 5   Interest_Rate             60732 non-null  int64
 6   Num_of_Loan               60732 non-null  object
 7   Delay_from_due_date       60732 non-null  int64
 8   Num_of_Delayed_Payment    60732 non-null  object
 9   Changed_Credit_Limit      60732 non-null  object
 10  Num_Credit_Inquiries      59566 non-null  float64
 11  Credit_Mix                60732 non-null  object
 12  Outstanding_Debt          60732 non-null  object
 13  Credit_Utilization_Ratio  60732 non-null  float64
 14  Credit_History_Age        55249 non-null  object
 15  Payment_of_Min_Amount     60732 non-null  object
 16  Total_EMI_per_month       60732 non-null  float64
 17  Amount_invested_monthly   57989 non-null  object
 18  Payment_Behaviour         60732 non-null  object
 19  Monthly_Balance           59855 non-null  object
 20  Credit_Score              60732 non-null  object
dtypes: float64(5), int64(4), object(12)
memory usage: 10.2+ MB

In [31]:
df.drop(['Changed_Credit_Limit'],inplace=True, axis=1)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60732 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       60732 non-null  object
 1   Annual_Income             60732 non-null  float64
 2   Monthly_Inhand_Salary     51667 non-null  float64
 3   Num_Bank_Accounts         60732 non-null  int64
 4   Num_Credit_Card           60732 non-null  int64
 5   Interest_Rate             60732 non-null  int64
 6   Num_of_Loan               60732 non-null  object
 7   Delay_from_due_date       60732 non-null  int64
 8   Num_of_Delayed_Payment    60732 non-null  object
 9   Num_Credit_Inquiries      59566 non-null  float64
 10  Credit_Mix                60732 non-null  object
 11  Outstanding_Debt          60732 non-null  object
 12  Credit_Utilization_Ratio  60732 non-null  float64
 13  Credit_History_Age        55249 non-null  object
 14  Payment_of_Min_Amount     60732 non-null  object
 15  Total_EMI_per_month       60732 non-null  float64
 16  Amount_invested_monthly   57989 non-null  object
 17  Payment_Behaviour         60732 non-null  object
 18  Monthly_Balance           59855 non-null  object
 19  Credit_Score              60732 non-null  object
dtypes: float64(5), int64(4), object(11)
memory usage: 9.7+ MB

In [33]:
df['Credit_Mix'] = df.Credit_Mix.str.replace('_','other')

In [34]:
df['Credit_Mix'].value_counts()

Standard    22755
Bad         14914
other       12313
Good        10750
Name: Credit_Mix, dtype: int64

In [35]:
df['Outstanding_Debt'] = df.Outstanding_Debt.str.replace('_','')

In [36]:
df['Outstanding_Debt'] = df.Outstanding_Debt.astype(float)

In [37]:
df['Outstanding_Debt'].value_counts()

1151.70    24
1360.45    22
240.27     16
2370.05    16
1584.95    16
           ..
1147.62     1
918.89      1
581.83      1
608.16      1
832.06      1
Name: Outstanding_Debt, Length: 8982, dtype: int64

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60732 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       60732 non-null  object
 1   Annual_Income             60732 non-null  float64
 2   Monthly_Inhand_Salary     51667 non-null  float64
 3   Num_Bank_Accounts         60732 non-null  int64
 4   Num_Credit_Card           60732 non-null  int64
 5   Interest_Rate             60732 non-null  int64
 6   Num_of_Loan               60732 non-null  object
 7   Delay_from_due_date       60732 non-null  int64
 8   Num_of_Delayed_Payment    60732 non-null  object
 9   Num_Credit_Inquiries      59566 non-null  float64
 10  Credit_Mix                60732 non-null  object
 11  Outstanding_Debt          60732 non-null  float64
 12  Credit_Utilization_Ratio  60732 non-null  float64
 13  Credit_History_Age        55249 non-null  object
 14  Payment_of_Min_Amount     60732 non-null  object
 15  Total_EMI_per_month       60732 non-null  float64
 16  Amount_invested_monthly   57989 non-null  object
 17  Payment_Behaviour         60732 non-null  object
 18  Monthly_Balance           59855 non-null  object
 19  Credit_Score              60732 non-null  object
dtypes: float64(6), int64(4), object(10)
memory usage: 9.7+ MB

In [39]:
df['Credit_History_Age'] = df['Credit_History_Age'].str[:2]

In [40]:
df['Credit_History_Age'] = df.Credit_History_Age.astype(object)

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60732 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       60732 non-null  object
 1   Annual_Income             60732 non-null  float64
 2   Monthly_Inhand_Salary     51667 non-null  float64
 3   Num_Bank_Accounts         60732 non-null  int64
 4   Num_Credit_Card           60732 non-null  int64
 5   Interest_Rate             60732 non-null  int64
 6   Num_of_Loan               60732 non-null  object
 7   Delay_from_due_date       60732 non-null  int64
 8   Num_of_Delayed_Payment    60732 non-null  object
 9   Num_Credit_Inquiries      59566 non-null  float64
 10  Credit_Mix                60732 non-null  object
 11  Outstanding_Debt          60732 non-null  float64
 12  Credit_Utilization_Ratio  60732 non-null  float64
 13  Credit_History_Age        55249 non-null  object
 14  Payment_of_Min_Amount     60732 non-null  object
 15  Total_EMI_per_month       60732 non-null  float64
 16  Amount_invested_monthly   57989 non-null  object
 17  Payment_Behaviour         60732 non-null  object
 18  Monthly_Balance           59855 non-null  object
 19  Credit_Score              60732 non-null  object
dtypes: float64(6), int64(4), object(10)
memory usage: 9.7+ MB

In [42]:
df['Payment_of_Min_Amount'].value_counts()

Yes    37027
No     16417
NM      7288
Name: Payment_of_Min_Amount, dtype: int64

In [43]:
df['Amount_invested_monthly'].value_counts()

__10000__             2621
0.0                    120
80.41529543900253        1
299.19414108909785       1
528.9301938908288        1
                      ...
51.692136743915356       1
167.8549671183016        1
82.28201778487923        1
145.83656360740954       1
167.1638651610451        1
Name: Amount_invested_monthly, Length: 55250, dtype: int64

In [44]:
df['Amount_invested_monthly'] = df.Amount_invested_monthly.str.replace('_','')

In [45]:
df['Amount_invested_monthly']= df.Amount_invested_monthly.astype(float)

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60732 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       60732 non-null  object
 1   Annual_Income             60732 non-null  float64
 2   Monthly_Inhand_Salary     51667 non-null  float64
 3   Num_Bank_Accounts         60732 non-null  int64
 4   Num_Credit_Card           60732 non-null  int64
 5   Interest_Rate             60732 non-null  int64
 6   Num_of_Loan               60732 non-null  object
 7   Delay_from_due_date       60732 non-null  int64
 8   Num_of_Delayed_Payment    60732 non-null  object
 9   Num_Credit_Inquiries      59566 non-null  float64
 10  Credit_Mix                60732 non-null  object
 11  Outstanding_Debt          60732 non-null  float64
 12  Credit_Utilization_Ratio  60732 non-null  float64
 13  Credit_History_Age        55249 non-null  object
 14  Payment_of_Min_Amount     60732 non-null  object
 15  Total_EMI_per_month       60732 non-null  float64
 16  Amount_invested_monthly   57989 non-null  float64
 17  Payment_Behaviour         60732 non-null  object
 18  Monthly_Balance           59855 non-null  object
 19  Credit_Score              60732 non-null  object
dtypes: float64(7), int64(4), object(9)
memory usage: 9.7+ MB

In [47]:
df.drop(['Payment_Behaviour'],inplace=True, axis=1)

In [48]:
df.Monthly_Balance.value_counts()

__-333333333333333333333333333__    6
312.49408867943663                  1
315.8409062259521                   1
365.2633969624913                   1
327.07621894423517                  1
                                   ..
276.412765134575                    1
94.48846088913422                   1
289.2458362192906                   1
490.20225630470907                  1
393.6736955618808                   1
Name: Monthly_Balance, Length: 59850, dtype: int64

In [49]:
df['Monthly_Balance'] = df.Monthly_Balance.str.replace('_','')

In [50]:
df['Monthly_Balance']= df.Monthly_Balance.astype(float)

In [51]:
df = df.loc[(df['Monthly_Balance'] > 1)]

In [52]:
df.Monthly_Balance.value_counts()

312.494089    1
530.604741    1
315.840906    1
470.641411    1
365.263397    1
             ..
243.573096    1
250.518838    1
276.412765    1
94.488461     1
393.673696    1
Name: Monthly_Balance, Length: 59835, dtype: int64

In [53]:
df['Credit_Score'].value_counts()

Standard    31169
Poor        20435
Good         8231
Name: Credit_Score, dtype: int64

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 59835 entries, 0 to 99999
Data columns (total 19 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       59835 non-null  object
 1   Annual_Income             59835 non-null  float64
 2   Monthly_Inhand_Salary     50899 non-null  float64
 3   Num_Bank_Accounts         59835 non-null  int64
 4   Num_Credit_Card           59835 non-null  int64
 5   Interest_Rate             59835 non-null  int64
 6   Num_of_Loan               59835 non-null  object
 7   Delay_from_due_date       59835 non-null  int64
 8   Num_of_Delayed_Payment    59835 non-null  object
 9   Num_Credit_Inquiries      58688 non-null  float64
 10  Credit_Mix                59835 non-null  object
 11  Outstanding_Debt          59835 non-null  float64
 12  Credit_Utilization_Ratio  59835 non-null  float64
 13  Credit_History_Age        54453 non-null  object
 14  Payment_of_Min_Amount     59835 non-null  object
 15  Total_EMI_per_month       59835 non-null  float64
 16  Amount_invested_monthly   57136 non-null  float64
 17  Monthly_Balance           59835 non-null  float64
 18  Credit_Score              59835 non-null  object
dtypes: float64(8), int64(4), object(7)
memory usage: 9.1+ MB

In [55]:
df.Credit_Score.value_counts()

Standard    31169
Poor        20435
Good         8231
Name: Credit_Score, dtype: int64

In [56]:
score_mapper = {"Poor":1, "Standard":2, "Good":3}

In [57]:
df["Credit_Score"] = df["Credit_Score"].replace(score_mapper)

In [61]:
df.head()

,Age,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Num_of_Loan,Delay_from_due_date,Num_of_Delayed_Payment,Num_Credit_Inquiries,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Monthly_Balance,Credit_Score
0,23.0,19114.12,1824.843333,3,4,3,4.0,3,7.0,4.0,other,809.98,26.822620,22,No,49.574949,80.415295,312.494089,3
3,23.0,19114.12,NaN,3,4,3,4.0,5,4.0,4.0,Good,809.98,31.377862,22,No,49.574949,199.458074,223.451310,3
5,23.0,19114.12,NaN,3,4,3,4.0,8,4.0,4.0,Good,809.98,27.262259,22,No,49.574949,62.430172,340.479212,3
6,23.0,19114.12,1824.843333,3,4,3,4.0,3,8.0,4.0,Good,809.98,22.537593,22,No,49.574949,178.344067,244.565317,3
7,23.0,19114.12,1824.843333,3,4,3,4.0,3,6.0,4.0,Good,809.98,23.933795,NaN,No,49.574949,24.785217,358.124168,2

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 59835 entries, 0 to 99999
Data columns (total 19 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       59835 non-null  object
 1   Annual_Income             59835 non-null  float64
 2   Monthly_Inhand_Salary     50899 non-null  float64
 3   Num_Bank_Accounts         59835 non-null  int64
 4   Num_Credit_Card           59835 non-null  int64
 5   Interest_Rate             59835 non-null  int64
 6   Num_of_Loan               59835 non-null  object
 7   Delay_from_due_date       59835 non-null  int64
 8   Num_of_Delayed_Payment    59835 non-null  object
 9   Num_Credit_Inquiries      58688 non-null  float64
 10  Credit_Mix                59835 non-null  object
 11  Outstanding_Debt          59835 non-null  float64
 12  Credit_Utilization_Ratio  59835 non-null  float64
 13  Credit_History_Age        54453 non-null  object
 14  Payment_of_Min_Amount     59835 non-null  object
 15  Total_EMI_per_month       59835 non-null  float64
 16  Amount_invested_monthly   57136 non-null  float64
 17  Monthly_Balance           59835 non-null  float64
 18  Credit_Score              59835 non-null  int64
dtypes: float64(8), int64(5), object(6)
memory usage: 9.1+ MB

In [65]:
df.to_csv('./data/cleaned_data3.csv')